#### Terraform Format and Style 🖌`failure`
### Workspace

`undefined`

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.user_membership["baolongv4@gmail.com"] will be created
  + resource "github_membership" "user_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "baolongv4@gmail.com"
    }

  # github_membership.user_membership["datpq@gmail.com"] will be created
  + resource "github_membership" "user_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "datpq@gmail.com"
    }

  # github_team.teams["backend"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Group consist of member in DevOps branchess"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "backend"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["devops"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "FPTU DSC DevOps branches"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "devops"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["frontend"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Group consist of member in DevOps branches"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "frontend"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.some_team_members["backend"] will be created
  + resource "github_team_members" "some_team_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "baolongv4@gmail.com"
        }
      + members {
          + role     = "member"
          + username = "datpq@gmail.com"
        }
    }

  # github_team_members.some_team_members["devops"] will be created
  + resource "github_team_members" "some_team_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "baolongv4@gmail.com"
        }
    }

  # github_team_members.some_team_members["frontend"] will be created
  + resource "github_team_members" "some_team_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "baolongv4@gmail.com"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Pusher**: @baolongkms
**Action**: pull_request
